antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
#include "app_common.h"

// needed for setenv and tzset :-/
#undef __STRICT_ANSI__
#include "time.h"
#include "stdlib.h"

#include "esp_sleep.h"
#include "esp_log.h"
#include "esp_system.h"  // esp_reset_reason
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include <math.h>
#include <string.h>
#ifdef CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH
#include "esp_core_dump.h"
#endif
#ifndef DISABLE_WIFI
#include "esp_wifi.h"
#include "esp_netif.h"
#include "esp_netif_sntp.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "freertos/event_groups.h"
#endif

#include "Display.h"
#include "TempHistory.h"
#include "RtcHistory.h"
#include "HistoryStore.h"

// Used for JTAG. Avoid for other purposes if possible
// Firebeetle Pin | JTAG PIN
//            12  |  TDI
//            13  |  TCK
//            14  |  TMS
//            15  |  TDO
// JTAG init and deep sleep don't seem to play well together
// openocd errors when trying to init JTAG during deep sleep:
//   Error: JTAG scan chain interrogation failed: all ones
//   Error: Check JTAG interface, timings, target power, etc.
//   Error: Trying to use configured scan chain anyway...
//   Error: esp32.cpu0: IR capture error; saw 0x1f not 0x01
// when that error is hit you might need to kill the openocd process even if debugging is stopped in VS code
// Repro cmd
// ~/.platformio/packages/tool-openocd-esp32/bin/openocd -s ~/.platformio/packages/tool-openocd-esp32 -c "gdb_port pipe; tcl_port disabled; telnet_port disabled" -s ~/.platformio/packages/tool-openocd-esp32/share/openocd/scripts -f interface/ftdi/esp32_devkitj_v1.cfg -f board/esp-wroom-32.cfg -c "adapter_khz 5000"

#if defined(USE_DS18B20_PAR)
  #include "sensors/DS18B20Sensor.hpp"
  DS18B20Sensor sensor;
#elif defined(USE_BMP390L)
  #include "sensors/BMP390LSensor.hpp"
  BMP390LSensor sensor;
#elif defined(USE_BMP58x)
  #include "sensors/BMP58xSensor.hpp"
  BMP58xSensor sensor;
#elif defined(USE_DUMMY_SENSOR)
  #include "sensors/DummySensor.hpp"
  DummySensor sensor;
#else
  #error "Unknown sensor type"
#endif

#if defined(HAS_ULP_SUPPORT) && defined(SOC_ULP_FSM_SUPPORTED)
void ulp_check_data_overlap();
#endif

#if defined(HAS_ULP_SUPPORT) && defined(SOC_LP_CORE_SUPPORTED) && SOC_LP_CORE_SUPPORTED
#include "ulp_main.h"  // exposes ulp_lp_wake_count and other LP-core globals
#endif

// --- RTC memory layout ---
// RTC memory survives deep sleep but NOT power-on reset (firmware upload,
// battery swap, reset button). More precisely: the bootloader reloads
// .rtc.data and startup zeroes .rtc.bss on ANY reset that isn't a deep-sleep
// wake (esp_image_format.c / cpu_start.c) — so RTC_DATA_ATTR state, including
// boot_count and all history, does not survive a panic/WDT/brownout reset
// either. .rtc_noinit is exempt from both, which is what CrashLog (below)
// relies on; it dies only with the RTC power domain (battery swap, or the
// FireBeetle's reset button, whose circuit power-cycles RTC).
//
// The history itself outlives all of that: HistoryStore mirrors it to the
// `history` flash partition, which an upload does not touch. What lands here on
// a cold boot is a restore from flash, not an empty buffer.
//
// RtcHistory, RTC_HISTORY_VERSION and the self_addr scheme live in
// include/RtcHistory.h so HistoryStore.cpp can serialize the same layout.
// Bump RTC_STATE_VERSION when changing operational state variables below.
#define RTC_STATE_VERSION   0xDA050005

// Initial min/max temperature sentinels (float).
// Any real reading will replace these on first comparison.
#define TEMP_INIT_MIN  999.0f
#define TEMP_INIT_MAX (-999.0f)

// Minimum temperature change (C) to trigger a display refresh
#define DISPLAY_TEMP_DELTA 0.1f

RTC_DATA_ATTR RtcHistory historical_data;

// Operational state — changes here are caught by self_addr if the linker
// shifts historical_data, and by RTC_STATE_VERSION for format changes.
RTC_DATA_ATTR uint32_t rtc_state_version = 0;

RTC_DATA_ATTR int boot_count = 0;
RTC_DATA_ATTR int display_refresh_count = 0;

// InitializeUlp() calls this power cycle. Healthy value is exactly 1 (first
// boot); anything higher means ULP/LP state (wake counters, delta reference)
// is being wiped in the field — rendered as "uN" in the footer when > 1.
RTC_DATA_ATTR uint32_t ulp_reinit_count = 0;

// Wakeup cause, cached before anything can light-sleep: esp_sleep reports the
// cause of the MOST RECENT sleep, and the EPD busy-wait light sleep
// (epd_busy_light_sleep) replaces the deep-sleep cause with its GPIO wake.
// Querying live after a display refresh misread every refresh boot as a fresh
// boot and reloaded the LP core each time (wiping its counters and delta
// reference). Always use these, never app_wakeup_cause(), past setup() entry.
static esp_sleep_wakeup_cause_t s_wake_cause = ESP_SLEEP_WAKEUP_UNDEFINED;
static uint32_t s_wake_causes_raw = 0;

// --- Crash forensics -------------------------------------------------------
// Lives in .rtc_noinit: the only RTC storage that survives panic/WDT/brownout
// resets (see RTC memory layout comment above). Breadcrumbs (stage,
// cur_boot_count, cur_time) are stamped while running; the first boot after
// an abnormal reset copies them into the last_* fields and, when a flash
// coredump is present, harvests the exception PC + task name. Garbage after a
// true power-on — guarded by the magic word. Rendered by the "! <reason>"
// status indicator until the next RTC power cycle.
#define CRASH_LOG_MAGIC 0xC0DEB008  // bump when CrashLog layout changes
struct CrashLog {
  uint32_t magic;
  // Live breadcrumbs, stamped as the current wake progresses
  uint8_t  stage;            // CrashStage checkpoint (Display.h)
  uint8_t  unused0;
  uint16_t unused1;
  int32_t  cur_boot_count;
  uint32_t cur_time;         // epoch, stamped once wall clock is known
  // Harvested on the first boot after an abnormal reset
  uint8_t  crash_count;      // abnormal resets since RTC power-on
  uint8_t  last_reason;      // esp_reset_reason_t
  uint8_t  last_stage;
  uint8_t  unused2;
  int32_t  last_boot_count;
  uint32_t last_time;
  uint32_t pc;               // coredump exception PC (0 = none)
  char     task[16];         // coredump crashed task name
  char     elf_sha[9];       // first 8 hex chars of the crashing app's ELF
                             // SHA256 — identifies which build to addr2line
};
