antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
RTC_NOINIT_ATTR static CrashLog crash_log;

static const char *reset_reason_str(uint8_t r)
{
  switch (r)
  {
    case ESP_RST_SW:         return "SW";
    case ESP_RST_PANIC:      return "PANIC";
    case ESP_RST_INT_WDT:    return "IWDT";
    case ESP_RST_TASK_WDT:   return "TWDT";
    case ESP_RST_WDT:        return "WDT";
    case ESP_RST_BROWNOUT:   return "BROWN";
    case ESP_RST_EFUSE:      return "EFUSE";
    case ESP_RST_PWR_GLITCH: return "GLITCH";
    case ESP_RST_CPU_LOCKUP: return "LOCKUP";
    default:                 return "RST";
  }
}

// Copy PC + task name out of a flash coredump into crash_log, then erase the
// dump so a stale one is never re-harvested after a later dump-less reset
// (e.g. RTC WDT, where the panic handler never ran).
static void harvest_coredump_summary()
{
  crash_log.pc = 0;
  crash_log.task[0] = '\0';
  crash_log.elf_sha[0] = '\0';
#ifdef CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH
  esp_core_dump_summary_t *sum =
      (esp_core_dump_summary_t *)calloc(1, sizeof(*sum));
  if (sum == NULL)
    return;
  if (esp_core_dump_get_summary(sum) == ESP_OK)
  {
    crash_log.pc = sum->exc_pc;
    memcpy(crash_log.task, sum->exc_task, sizeof(crash_log.task));
    crash_log.task[sizeof(crash_log.task) - 1] = '\0';
    // Already a hex string in the summary; keep the first 8 chars
    size_t sha_n = strnlen((const char *)sum->app_elf_sha256,
                           sizeof(crash_log.elf_sha) - 1);
    memcpy(crash_log.elf_sha, sum->app_elf_sha256, sha_n);
    crash_log.elf_sha[sha_n] = '\0';
    esp_core_dump_image_erase();
  }
  free(sum);
#endif
}

// Detect and record an abnormal reset. Must run before RTC state is used in
// anger, but after setup_serial() so the LOGI is visible.
static void crash_forensics_on_boot()
{
  esp_reset_reason_t rr = esp_reset_reason();
  if (crash_log.magic != CRASH_LOG_MAGIC)
  {
    // True power-on (or first firmware with CrashLog): noinit RAM is garbage
    memset(&crash_log, 0, sizeof(crash_log));
    crash_log.magic = CRASH_LOG_MAGIC;
  }
  else if (rr != ESP_RST_DEEPSLEEP && rr != ESP_RST_POWERON &&
           rr != ESP_RST_USB && rr != ESP_RST_JTAG && rr != ESP_RST_SDIO)
  {
    // USB/JTAG/SDIO excluded: flash-tool resets, not field crashes
    if (crash_log.crash_count < 255)
      crash_log.crash_count++;
    crash_log.last_reason     = (uint8_t)rr;
    crash_log.last_stage      = crash_log.stage;
    crash_log.last_boot_count = crash_log.cur_boot_count;
    crash_log.last_time       = crash_log.cur_time;
    harvest_coredump_summary();
    LOGI("Abnormal reset #%u: %s at boot %d stage %d pc 0x%x %s",
         (unsigned)crash_log.crash_count, reset_reason_str(crash_log.last_reason),
         (int)crash_log.last_boot_count, (int)crash_log.last_stage,
         (unsigned)crash_log.pc, crash_log.task);
  }
  crash_log.stage = STAGE_BOOT;
}

RTC_DATA_ATTR time_t first_boot_time = 0;
RTC_DATA_ATTR time_t next_clear_time = 0;
const time_t one_day = 86400;

// The last temperature actually measured, and the reference the sensor drivers
// compare a suspicious coprocessor reading against (a jump past TEMP_REREAD_DELTA
// triggers a direct I2C re-read). They skip that check when it holds the sentinel,
// so this must never be blanked: doing so switches the verification off for
// exactly the wakes following a fault, which is when it is needed most.
RTC_DATA_ATTR float previous_temp = TEMP_NO_PREVIOUS;
// What the panel is showing, which is a different question — a rejected reading
// blanks it to "--.-" while previous_temp keeps the last real value — so the two
// cannot share one variable. Costs 4 bytes of the RTC area the ULP data segment
// sits above; the build prints the remaining headroom on every ESP32-E build.
RTC_DATA_ATTR bool panel_shows_reading = false;
RTC_DATA_ATTR int previous_boot_count = -1;
// While the panel is blanked nothing changes, so nothing redraws and the counters
// on screen freeze — leaving a wedged device indistinguishable from a quiet one.
// Repaint occasionally so the fault stays legible, counted in wakes because that
// is what the fault itself drives.
#define FAULT_REPAINT_WAKES 30

RTC_DATA_ATTR uint32_t max_battery_mv = 0;

RTC_DATA_ATTR uint32_t bad_pin27_count = 0;

// Min/max temperature since boot
RTC_DATA_ATTR float min_temp_since_boot = TEMP_INIT_MIN;
RTC_DATA_ATTR float max_temp_since_boot = TEMP_INIT_MAX;

// Bootstrap budget for the very first sync (see ntp_bootstrap_sync).
#define NTP_BOOTSTRAP_ASSOC_TRIES     3
#define NTP_BOOTSTRAP_SNTP_TRIES      3
#define NTP_BOOTSTRAP_SNTP_TIMEOUT_MS 10000U
// Wakes between bootstrap retries, doubling to 8x this on repeated failure.
#define NTP_BOOTSTRAP_FIRST_WAKES     8

// Minimum resync interval (1 day) — floor to avoid hammering WiFi.
// Overridable so a bench build can force attempts on a short cadence: measuring
// the charge of a resync (successful or timed out) otherwise means waiting a day
// for each sample. Never ship an override — see the revert list in CLAUDE.md.
#ifdef RESYNC_INTERVAL_MIN
// Already defined means a build override is in force. Flagged so the adaptive
// rule can be pinned (it would otherwise double the interval away from the
// cadence the override exists to create) and so the panel can say so.
#define RESYNC_INTERVAL_OVERRIDDEN 1
#else
#define RESYNC_INTERVAL_MIN  (86400)
#endif
// Maximum resync interval (4 weeks)
#define RESYNC_INTERVAL_MAX  (28 * 86400)

// Periodic NTP resync state
RTC_DATA_ATTR time_t next_resync_time = 0;           // when to next attempt NTP resync
// Starts at the floor: the first resync is the only measurement the device has
// for a fortnight otherwise, and a healthy clock climbs back out fast (each
// negligible-drift resync doubles the interval, so 1d → 28d in five wakes).
RTC_DATA_ATTR int32_t resync_interval_s = RESYNC_INTERVAL_MIN;
RTC_DATA_ATTR int32_t last_drift_ms = 0;             // drift measured at last resync (positive = clock ahead)
RTC_DATA_ATTR int32_t last_drift_window_s = 0;       // measured span the drift accumulated over (NOT the interval setting: failed attempts stretch it)
RTC_DATA_ATTR time_t last_sync_time = 0;             // wall-clock of last successful NTP sync (0 = never)
RTC_DATA_ATTR uint16_t resync_fail_count = 0;        // failed resync attempts since the last success
// Rate history, newest last. One measurement says how far the clock ran off;
// several say whether the RC oscillator's error is a stable constant (which is
// what drift compensation would need) or wanders with temperature.
RTC_DATA_ATTR int16_t drift_ppm_hist[DRIFT_PPM_HIST_SIZE] = {};
RTC_DATA_ATTR uint16_t drift_win_min[DRIFT_PPM_HIST_SIZE] = {};  // window per rate, for weighting
RTC_DATA_ATTR uint8_t drift_ppm_count = 0;

// Status flags for display error indicators
RTC_DATA_ATTR bool wifi_ok = false;
RTC_DATA_ATTR bool ntp_synced = false;
RTC_DATA_ATTR bool last_sensor_ok = true;
// This wake only, so deliberately not RTC state: "the coprocessor handed up a
// reading we could not use". It is the sole trigger for the recovery reload
// below — every route to a coprocessor problem sets it, and a stale RTC flag in
// that condition would reload the program on wakes where nothing went wrong.
static bool s_ulp_read_failed = false;

// Gather/scatter the drift block for the flash archive. Keeping it in one place
// means the on-flash layout (HistoryDriftState) and these RTC variables can
// only drift apart in one file.
static void drift_state_save(HistoryDriftState *d)
{
  d->resync_interval_s = resync_interval_s;
  d->last_drift_ms = last_drift_ms;
  d->last_drift_window_s = last_drift_window_s;
  d->last_sync_time = (int64_t)last_sync_time;
  d->resync_fail_count = resync_fail_count;
  d->drift_ppm_count = drift_ppm_count;
  d->rsvd = 0;
  memcpy(d->drift_ppm_hist, drift_ppm_hist, sizeof(drift_ppm_hist));
  memcpy(d->drift_win_min, drift_win_min, sizeof(drift_win_min));
}

// `trust_clock` gates only last_sync_time: it is the reference maybe_ntp_resync()
// measures the next drift window against, so restoring it under a clock that
// has not been set yet would produce a nonsense window on the first resync
// after a power-cycle. The rates themselves are timeless and always restored.
static void drift_state_load(const HistoryDriftState *d, bool trust_clock)
{
  // Everything here is sanitized, not trusted. Flash content can be stale,
  // truncated, or injected by tools/history.py, and this block feeds the WiFi
  // scheduler — an out-of-range interval is a battery problem, not a cosmetic
  // one. A restored resync_interval_s of 0 would make next_resync_time land on
  // `now`, so every subsequent wake would bring up WiFi (1.5-4.5C per failed
  // attempt, docs/clock-drift.md).
  resync_interval_s = d->resync_interval_s;
  if (resync_interval_s < RESYNC_INTERVAL_MIN) resync_interval_s = RESYNC_INTERVAL_MIN;
  if (resync_interval_s > RESYNC_INTERVAL_MAX) resync_interval_s = RESYNC_INTERVAL_MAX;

  last_drift_ms = d->last_drift_ms;
  last_drift_window_s = d->last_drift_window_s;
  resync_fail_count = d->resync_fail_count;

