antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
uint16_t buttonRead(uint8_t pin)
{
  gpio_config_t cfg = {};
  cfg.pin_bit_mask = 1ULL << pin;
  cfg.mode = GPIO_MODE_INPUT;
  cfg.pull_up_en = GPIO_PULLUP_ENABLE;
  gpio_config(&cfg);
  return gpio_get_level((gpio_num_t)pin); // return 0 when pressed
}

#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
#define SHUTDOWN_BUTTON_PIN 27
#elif defined(ARDUINO_XIAO_ESP32C6)
#define SHUTDOWN_BUTTON_PIN 9
#else
  #error "Unknown board type"
#endif

void handle_permanent_shutdown(uint32_t battery_mv)
{
  uint16_t pin27 = buttonRead(SHUTDOWN_BUTTON_PIN);
  LOGI("Button read %d: %d", SHUTDOWN_BUTTON_PIN, pin27);
  // On USB power the measured voltage is the charger CV node, not battery
  // SoC — never let it trigger the permanent shutdown while charging.
  if (pin27 == 0 || (battery_mv < no_battery_mv && !vbus_present()))
  {
    // If button is pressed or battery is dead, powerdown
    if (pin27 == 0)
    {
      // Looks like we might be getting extremely rare spurious reads of 0
      // Double check after a delay ...
      sleep_ms(1000);
      pin27 = buttonRead(SHUTDOWN_BUTTON_PIN);
      LOGI("Button read %d confirmation: %d", SHUTDOWN_BUTTON_PIN, pin27);
      if (pin27 != 0)
      {
        bad_pin27_count++;
        return;
      }

      display_clear();

      // ... and add somethign on screen for diagnostics purposes in case the delay isn't sufficient
      // TODO remove this later
      display_show_pin27_diagnostic(boot_count);
    }
    else //  battery_mv < no_battery_mv
    {
      time_t now;
      struct tm nowtm;
      get_time(&now, &nowtm);
      display_show_empty_battery(battery_mv, now, make_display_stats());
    }

    // This path bypasses start_deep_sleep(), so flush explicitly — it is the
    // one moment the archive most needs to be current, since the device is
    // about to be off indefinitely. Hourly entries were journaled as they were
    // finalized and are already safe; what would otherwise be lost is the base
    // snapshot, and with it the sparkline and the drift block.
    history_store_persist_now();

    for (int domain = 0; domain < ESP_PD_DOMAIN_MAX; domain++)
      esp_sleep_pd_config((esp_sleep_pd_domain_t)domain, ESP_PD_OPTION_OFF);
    LOGI("Shutting down until reset. All sleep pd domains have been shutdown.");
    esp_deep_sleep_start();
  }
}

void on_first_boot()
{
#ifdef DISABLE_WIFI
  LOGI("WiFi has been disabled at build time with DISABLE_WIFI. See local-secrets.h to fix.");
  // Not an error — suppress "! NO WIFI" indicator on display
  wifi_ok = true;
  set_status_led(rgb(255, 255, 0));
  sleep_ms(100);
#else
  #if !(defined(MY_WIFI_SSID) && defined(MY_WIFI_PASSWORD))
    #error "MY_WIFI_SSID and/or MY_WIFI_PASSWORD are not defined. See local-secrets.h to fix."
  #endif
  if (*MY_WIFI_SSID == 0)
  {
    LOGI("Missing WiFi SSID. Will assume network connectivity isn't possible. See local-secrets.h to fix.");
    return;
  }

  // Connect to WiFi with timeout (avoids hanging forever if network is down)
  LOGI("Connecting to WiFi and synchronizing time");
  set_status_led(rgb(0, 0, 255));

  // Retries inside one session, and handles its own WiFi teardown. Getting the
  // clock on the first boot matters more than it used to: without one the
  // device records no history at all, and a failure here used to be permanent.
  const bool synced = ntp_bootstrap_sync(NTP_BOOTSTRAP_ASSOC_TRIES);
  if (!synced)
    resync_fail_count++;   // wifi_ok separately reflects the association
  set_status_led(synced ? rgb(0, 255, 0) : rgb(255, 0, 0));

  // Judge the clock on its own merits either way. A failed sync does not mean
  // there is no time: a panic or WDT reset reloads .rtc.data — so boot_count is
  // back to 1 and this runs again — while the RTC timer keeps counting
  // correctly across it. Returning early instead left first_boot_time at 0,
  // which renders as a ~20601d uptime, hides the boot date, shows a permanent
  // NO-NTP badge against a correct clock, and keeps maybe_ntp_resync() on the
  // WiFi-burning bootstrap path indefinitely.
  time(&first_boot_time);
  ntp_synced = time_is_plausible(first_boot_time);
  if (ntp_synced && last_sync_time == 0)
    last_sync_time = first_boot_time;   // a value restored from flash wins
  if (!synced)
    LOGI("NTP sync failed — %s", ntp_synced
             ? "RTC clock is still plausible, keeping it"
             : "time is unreliable, will retry on later wakes");
#endif
}


bool periodic_display_clear(const time_t now, struct tm nowtm)
{
  // Trigger screen clear daily
  if (next_clear_time == 0)
  {
    if (now < one_day)
    {
      // We don't seem to have a synchronized clock, clear screen periodically from first boot
      next_clear_time = now + one_day;
    }
    else
    {
      // We have a synchronzied clock, clear screen periodically when it's likely to be least disruptive
      // Let's pick the next time it's 04h00
      time_t offset = 0;
      if (4 <= nowtm.tm_hour)
      {
        offset = one_day;
      }
      nowtm.tm_hour = 4;
      nowtm.tm_min = 0;
      nowtm.tm_sec = 0;
      next_clear_time = mktime(&nowtm) + offset;
    }
  }

  if (now < next_clear_time)
  {
    return false;
  }

  display_clear();
  next_clear_time += one_day; // Schedule next clear in a day
  return true;
}

void refresh_and_sleep(uint32_t battery_mv, float temp)
{
  time_t now;
  struct tm nowtm;
  get_time(&now, &nowtm);

#ifndef DISABLE_WIFI
  crash_log.stage = STAGE_NTP;
  maybe_ntp_resync(now);
  // Re-read time after potential resync correction
  get_time(&now, &nowtm);
#endif
  crash_log.cur_time = (uint32_t)now;

#ifdef MOCK_DISPLAY_DATA
  // Override the sensor reading to match the mock data range so it doesn't
  // distort the chart Y-axis (DummySensor returns a constant 12.3°C). Applied
  // before validity is decided, so the substitute is treated as the reading for
  // every purpose below rather than being rendered as a number the same frame
  // calls invalid.
  temp = 22.3f;
#endif

  // One decision, used for recording and display alike, so the two can never
  // disagree about what was believed. A rejected reading must reach neither: it
  // would be a fabricated point in the sparkline, the hourly ring and the min/max,
  // none of which can be undone once mirrored to flash.
  //
  // A reading that arrives over the CPU's own bus carries the sensor's identity
  // with it, because Initialize() rechecks the chip ID. One from the coprocessor
  // does not — see setup() for why recovery on the C6 has to accept it anyway.
  const bool temp_trusted = (temp != TEMP_NO_PREVIOUS);

  if (temp_trusted)
    update_temp_extremes(temp);
  // Called either way: the hour bookkeeping has to keep moving so the outage is
  // recorded as hours that measured nothing.
  update_hourly_history(now, &nowtm, temp, temp_trusted);

