antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  LOGI("now: %ld. next clear time: %ld. first boot time: %ld. prev_temp: %.1f",
       (long)now, (long)next_clear_time, (long)first_boot_time, previous_temp);
  // RENDER covers both the periodic clear and the refresh below — either can
  // die mid-EPD-write (SPI, busy-wait light sleep, panel power)
  crash_log.stage = STAGE_RENDER;

#ifdef CRASH_TEST_BOOT
  // Deliberate crash to exercise the forensics path on hardware — flash with
  //   PLATFORMIO_BUILD_FLAGS="-DCRASH_TEST_BOOT=3" pio run -e <env> -t upload
  // (add -DCRASH_TEST_HANG to test the task-WDT→panic path instead of a null
  // deref). Fires on the first wake at/after that boot count, once per RTC
  // power cycle: the crash_count guard stops a crash loop, and also means a
  // second test needs a power cycle (which clears the CrashLog) first.
  if (boot_count >= CRASH_TEST_BOOT && crash_log.crash_count == 0)
  {
    LOGI("CRASH_TEST_BOOT: deliberately crashing at boot %d", boot_count);
    fflush(stdout);
#ifdef CRASH_TEST_HANG
    while (true) {}                    // starve idle task → TWDT → panic
#else
    *(volatile uint32_t *)0 = 0xdead;  // store to NULL → panic + coredump
#endif
  }
#endif
  // Reasons to redraw. Gaining or losing a reading is tested against the panel
  // rather than against previous_temp, since the delta is meaningless when either
  // side is not a measurement; and a persistent fault redraws only on the
  // heartbeat, so it cannot churn the panel.
  const bool fault_heartbeat = !temp_trusted && !panel_shows_reading &&
                               previous_boot_count >= 0 &&
                               (boot_count - previous_boot_count) >= FAULT_REPAINT_WAKES;
  bool should_refresh = periodic_display_clear(now, nowtm) ||
                        previous_boot_count < 0 ||   // nothing rendered yet this RTC epoch
                        temp_trusted != panel_shows_reading ||
                        fault_heartbeat ||
                        (temp_trusted && fabsf(temp - previous_temp) >= DISPLAY_TEMP_DELTA);
  if (!should_refresh)
  {
    LOGI("temperature hasn't changed significantly, no need to refresh display");
  }
  else
  {
    display_refresh_count++;
    if (max_battery_mv < battery_mv)
      max_battery_mv = battery_mv;

    // Same plausibility gate as update_hourly_history(): a 1970 timestamp here
    // would sit ~54 years before every stored point and never leave the window.
    // Not journaled — the sparkline rides along in the base snapshot instead.
    if (time_is_plausible(now) && temp_trusted)
      temp_history_record(historical_data.temp, &historical_data.temp_count,
                          now, (int16_t)(temp * 10));

    // The badge describes the frame about to be drawn, so fold in the trust
    // decision without discarding what the read path already reported: a wake
    // rescued by a direct read after the coprocessor failed still gets a badge.
    last_sensor_ok = last_sensor_ok && temp_trusted;

    PPK2_DISPLAY_HIGH();
    display_show_temperature(temp_trusted ? temp : TEMP_NO_PREVIOUS,
                             battery_mv, battery_mv < low_battery_mv,
                             now, &nowtm, make_display_stats());
    PPK2_DISPLAY_LOW();

    if (temp_trusted)
      previous_temp = temp;
    panel_shows_reading = temp_trusted;
    previous_boot_count = boot_count;
  }

  // Reload the coprocessor program on a fresh boot, and on any wake whose
  // coprocessor reading could not be used. InitializeUlp() is the only thing that
  // writes OSR_CONFIG and loads the program, so a sensor that lost power comes
  // back at its reset defaults and stays misconfigured until something reloads it;
  // doing it here is what a manual power cycle would otherwise be needed for. An
  // ordinary wake must not reload — the coprocessor is running and configured.
  //
  // The cause tested must be the CACHED one: the EPD busy-wait light sleeps have
  // replaced the live wakeup cause with their own GPIO wake by this point, so
  // reading it here reports a fresh boot on every refresh.
  //
  // Deliberately unbounded. A sensor that NACKs makes the LP core wake the CPU on
  // every failed read (both error paths in ulp/lp_core_*.h wake unconditionally), so
  // the program reloads once per SLEEP_INTERVAL_S for as long as the fault lasts.
  // Accepted rather than bounded: the mode is rare, and it either clears on the next
  // reading or the device is unusable anyway. Note the "uN" footer count climbs but
  // is only re-rendered when something else triggers a refresh, so a persistent fault
  // sits on the panel as "! SENSOR" beside a stale count, not a visibly rising one.
  if (sensor.SupportsUlp()
      && (s_wake_cause == ESP_SLEEP_WAKEUP_UNDEFINED || s_ulp_read_failed || !temp_trusted))
  {
    crash_log.stage = STAGE_LP_INIT;
    ulp_reinit_count++;
    // Only a genuine power cycle leaves the coprocessor's shared state
    // uninitialised; a recovery reload must keep the counters and delta reference
    // it already has.
    sensor.InitializeUlp(s_wake_cause == ESP_SLEEP_WAKEUP_UNDEFINED);
  }

  start_deep_sleep();
}


// Reset history buffers (sparkline + hourly).
// Called when the history data format changes (struct layout, buffer sizes).
static void reset_rtc_history()
{
  memset(&historical_data, 0, sizeof(historical_data));
  historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
  historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  historical_data.version = RTC_HISTORY_VERSION;
  historical_data.self_addr = (uint32_t)&historical_data;
}

// Reset operational state (counters, flags, thresholds).
// Called when non-history RTC variables change. Preserves history.
static void reset_rtc_state()
{
  boot_count = 0;
  display_refresh_count = 0;
  ulp_reinit_count = 0;
  first_boot_time = 0;
  next_clear_time = 0;
  previous_temp = TEMP_NO_PREVIOUS;
  panel_shows_reading = false;
  previous_boot_count = -1;
  max_battery_mv = 0;
  bad_pin27_count = 0;
  min_temp_since_boot = TEMP_INIT_MIN;
  max_temp_since_boot = TEMP_INIT_MAX;
  next_resync_time = 0;
  resync_interval_s = RESYNC_INTERVAL_MIN;
  last_drift_ms = 0;
  last_drift_window_s = 0;
  last_sync_time = 0;
  resync_fail_count = 0;
  memset(drift_ppm_hist, 0, sizeof(drift_ppm_hist));
  memset(drift_win_min, 0, sizeof(drift_win_min));
  drift_ppm_count = 0;
  wifi_ok = false;
  ntp_synced = false;
  last_sensor_ok = true;
  rtc_state_version = RTC_STATE_VERSION;
}

// Pull the history and drift block back out of the flash archive.
//
// Deliberately NOT gated on a plausible clock. A first-boot NTP failure is
// permanent today (on_first_boot() runs only at boot_count==1, and
// maybe_ntp_resync() returns early while !ntp_synced), and it is common on the
// XIAO boards — so waiting for a good clock would often mean never restoring at
// all, leaving 30 days of readable history invisible. The snapshot is
// internally consistent on its own; the clock is only needed to place *new*
// readings against it, which update_hourly_history() already refuses to do
// without one.
//
// current_hour_start is left at 0 (reset_rtc_history() zeroed it), which is the
// existing "first reading after boot" sentinel: no finalize can fire until a
// reading with a real clock arrives, and the gap between the snapshot and now
// is then filled with HOURLY_NO_DATA by the normal path.
static void restore_history_from_flash()
{
  HistoryDriftState drift;
  if (!history_store_restore(&historical_data, &drift))
  {
    reset_rtc_history();  // partial reads may have touched it
    return;
  }
  historical_data.self_addr = (uint32_t)&historical_data;
  historical_data.current_hour_start = 0;
  historical_data.current_hour_sum_x10 = 0;
  historical_data.current_hour_sample_count = 0;
  historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
  historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;

  time_t now;
  time(&now);
  drift_state_load(&drift, time_is_plausible(now) &&
                               now >= (time_t)drift.last_sync_time);
}

// Same, for the branch where RTC history survived but the state block was
// reset. The archive's copy is at least as fresh as the one just cleared.
static void restore_drift_from_flash()
{
  HistoryDriftState drift;
  if (!history_store_restore(nullptr, &drift))
    return;
  time_t now;
  time(&now);
  drift_state_load(&drift, time_is_plausible(now) &&
                               now >= (time_t)drift.last_sync_time);
}

#ifdef PPK2_DEBUG
// Marker fingerprint, emitted on every wake so PPK2 wiring can be confirmed
// against the capture it actually produced rather than against a boot that may
// not be in frame. The pattern differs in BOTH count and width per lane — 2x10ms
// on CPU-active, 5x4ms on display/flash — so a lane is still identifiable when a
// pulse is clipped at a capture boundary. It also reads the pads back, which
// separates "the firmware isn't driving the pin" from "the lead is on the wrong
// pin"; a flat channel with a passing read-back is a wiring fault.
//
// 80ms total, down from the 400ms this used to cost. That earlier version was
// gated to the first boot to keep it off the energy budget, which silently
// removed crossed-lead detection from every capture that did not start with an
// RTC-wiped boot — the leads were in fact crossed on this rig and the fingerprint
// is what caught it. 80ms per wake (~1.4 mC) buys the check back on every wake.
//
// Pulses this short do not survive decimation — analyse marker captures with
// --decimate 1. Marker captures are short and want that anyway, and long
// production captures carry no markers at all.
// Kept in sync with check_selftest() in tools/ppk2.py, which pattern-matches
// these exact counts and widths to tell the lanes apart.
#define PPK2_FP_CPU_PULSES   2
#define PPK2_FP_CPU_MS      10
#define PPK2_FP_DISP_PULSES  5
#define PPK2_FP_DISP_MS      4

